app/controllers/users_controller.rb

INSERT INTO "users" ("name", "city", "salt", "dob", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "role", "activation_code", "gender", "remember_token", "cell_no", "login", "reset_code", "email") VALUES('zaeem', 'lahore', '162689d40d80e1cfacedc007c233ee4835a80195', NULL, '2011-08-25 09:07:47', NULL, '08cde58eda4bca0ead1d9755b4a28663eaececf3', NULL, '2011-08-25 09:07:47', 'client', 'dbe1ab04e1b4be72a0d962db817a18c0e344291d', 'male', NULL, '324234234234', 'zaeem', NULL, 'zaeem.asif@gmail.com')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save

SELECT * FROM "users" WHERE ("users"."activation_code" = 'dbe1ab04e1b4be72a0d962db817a18c0e344291d') LIMIT 1
---
  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])