app/controllers/vendors_controller.rb

SELECT * FROM "part_categories" WHERE (name in ("Repair & Servicing","Authorised Distributor Workshops","Air Conditioning","Car Parts Stockists","Upholstery - Seats & Tops","Towing Service","Spray Painting","Accident Repairs & Claims","Windscreen Repair"))
---
  def hotdeals
    @car_accessories = PartCategory.find :all, :conditions => 'name in ("Security System","Audio System - In Car Entertainment","Accessories Retail","Car Mats","Keys & Remote","Tracking & Navigation")'

SELECT * FROM "vendors"
SELECT * FROM "part_categories" ORDER BY name ASC
---
  def index
    keyword = ''
    category_id = ''
    distance = ''
    area = ''

    keyword = params[:keyword]
    category_id = params[:category]
    distance = params[:select_distance]
    area = params[:select_area]

    @vendors_keyword = []
    @vendors_category = []
    @vendors_area = []

    @keyword_category = ''

    unless keyword.nil?
      if keyword != 'Company name, product or brand'
        @vendors_keyword = Vendor.find :all, :conditions => ['name like ?', "%#{keyword}%"]
        if @vendors_keyword.empty?
          brand = Brand.find :all, :conditions => ['name like ?', "%#{keyword}%"]
          if brand.empty?
            part_category = PartCategory.find :all, :conditions => ['name like ?', "%#{keyword}%"]

SELECT * FROM "regions"
---
    end

    @part_categories = PartCategory.find :all, :order => 'name ASC'
    @regions = Region.all